MENU_BTN = "🍽 Получить меню"
WHICH_WEEK_BTN = "📅 Какая неделя?"
APPEAL_BTN = "📨 Обращение для ПрофСовета"
SCHEDULE_RINGS_BTN = "🔔Расписание звонков"
LOAD_MENU_BTN = "📤 Загрузить меню"
SUB_BTN = 'Подписаться на канал'

ANSWER_ANON = "Ответить"
ANSWER_GO = "Сообщение было доставлено пользователю!"

START_MSG = "Привет! Я бот ПрофСовета. Выберите действие:"
SUB_MSG = "Перед использованием бота нужно подписаться на наш канал."

APPEAL_SUCCES_MSG = "✅ Ваше обращение отправлено в ПрофСовет!"
APPEAL_ERROR_MSG = "❌ Не удалось отправить обращение. Попробуйте позже." 

CANCEL_MSG = "❌ Действие отменено"

MENU_REFRESH_MSG = "✅ Меню успешно обновлено!"

SCHEDULE_RINGS_MSG = """ 
🔔 Расписание звонков: 
 
• 1 пара | 9.00 — 10.20 
• 2 пара | 10.30 — 11.50 
• Обед⠀ | 11.50 — 12.50 
• 3 пара | 12.50 — 14.10 
• 4 пара | 14.20 — 15.40 
• 5 пара | 15.50 — 17.10 
• 6 пара | 17.20 — 18.40 
• 7 пара | 18.50 — 20.10 
"""
NEW_ANON_MSG = "📨 Новое анонимное обращение:\n\n"